<?php

return [
  'api' => [

    'weather' => [
      'key' =>  env('WEATHER_CAST_API_KEY'),
    ],

    'twitter' => [
      'settings' => [
        'getNum' => 12, //環境ごとに変わるなら
      ],
      'key' =>  env('TWITTER_API_KEY'),
      'key_secret' =>  env('TWITTER_API_KEY_SECRET'),
      'access_token' =>  env('TWITTER_API_ACCESS_TOKEN'),
      'access_token_secret' =>  env('TWITTER_API_ACCESS_TOKEN_SECRET'),
    ],
  ],

  'positions' => [
    '札幌' => [
      'lat' => 43.061936,
      'lon' => 141.3542924,
    ],
    '秋田' => [
      'lat' => 33.7631297,
      'lon' => 134.0278494,
    ],
    '岩手' => [
      'lat' => 39.9721005,
      'lon' => 141.2119414,
    ],
    '長野' => [
      'lat' => 36.6485851,
      'lon' => 138.1947664,
    ],
    '東京' => [
      'lat' => 5.7968777,
      'lon' => 142.8381612,
    ],
    '千葉' => [
      'lat' => 38.3200705,
      'lon' => 23.3175613,
    ],
    '神奈川' => [
      'lat' => 35.1342467,
      'lon' => 133.0911577,
    ],
    '栃木' => [
      'lat' => 36.3818177,
      'lon' => 139.733591,
    ],
    '岐阜' => [
      'lat' => 35.4230949,
      'lon' => 136.7627526,
    ],
    '石川' => [
      'lat' => 36.2577315,
      'lon' => 139.6931937,
    ],
    '大阪' => [
      'lat' => 35.2524044,
      'lon' => 140.0419644,
    ],
    '兵庫' => [
      'lat' => 34.4512228,
      'lon' => 135.7738924,
    ],
    '奈良' => [
      'lat' => 34.6845445,
      'lon' => 135.8048359,
    ],
    '京都' => [
      'lat' => 35.021041,
      'lon' => 135.7556075,
    ],
    '徳島' => [
      'lat' => 34.0698307,
      'lon' => 134.5550353,
    ],
    '広島' => [
      'lat' => 34.3916058,
      'lon' => 132.4518156,
    ],
    '岡山' => [
      'lat' => 34.6553944,
      'lon' => 133.9194595,
    ],
    '福岡' => [
      'lat' => 36.2598266,
      'lon' => 138.8899792,
    ],
    '佐賀' => [
      'lat' => 33.2639134,
      'lon' => 138.8899792,
    ],
    '沖縄' => [
      'lat' => 3.6888671,
      'lon' => 125.5353146,
    ],
  ],
];
